app/Services/DashboardService.php

    public function getKpi(): array
    {
        // Kompatibilitas lintas migrasi: ada branch yang memakai
        // status_ketersediaan, ada yang status_tersedia.
        $statusPetugasColumn = DB::getSchemaBuilder()->hasColumn('petugas', 'status_ketersediaan')
            ? 'status_ketersediaan'
            : 'status_tersedia';

        return [
            'total_masuk'         => Pengaduan::count(),
            'menunggu_verifikasi' => Pengaduan::byStatus('menunggu_verifikasi')->count(),
            'diproses'            => Pengaduan::whereIn('status', [
                'disetujui', 'ditugaskan', 'diproses', 'sedang_diproses',
            ])->count(),
            'selesai'             => Pengaduan::byStatus('selesai')->count(),
---
select count(*) as aggregate from `pengaduan` where `status` = 'menunggu_verifikasi'
select count(*) as aggregate from `pengaduan` where `status` in ('disetujui', 'ditugaskan', 'diproses', 'sedang_diproses')
select count(*) as aggregate from `pengaduan` where `status` = 'selesai'

    public function getPerKategori(): array
    {
        return Pengaduan::select('kategori_id', DB::raw('count(*) as total'))
            ->with('kategori:id,nama_kategori')
            ->groupBy('kategori_id')
            ->get()
            ->map(fn($row) => [
                'label' => $row->kategori->nama_kategori ?? 'Lainnya',
                'count' => $row->total,
            ])
            ->toArray();
---
select `kategori_id`, count(*) as total from `pengaduan` group by `kategori_id`

    public function getPerZona(): array
    {
        return Pengaduan::select('zona_id', DB::raw('count(*) as total'))
            ->with('zona:id,nama_zona')
            ->groupBy('zona_id')
            ->get()
            ->map(fn($row) => [
                'label' => $row->zona->nama_zona ?? 'Tidak Diketahui',
                'count' => $row->total,
            ])
            ->toArray();
---
select `zona_id`, count(*) as total from `pengaduan` group by `zona_id`

    public function getTrenBulanan(): array
    {
        $months = collect(range(11, 0))->map(fn($i) => Carbon::now()->subMonths($i));

        return $months->map(function ($month) {
            return [
                'label' => $month->translatedFormat('M Y'),
                'count' => Pengaduan::whereYear('created_at', $month->year)
                    ->whereMonth('created_at', $month->month)
                    ->count(),
            ];
        })->toArray();
---
select count(*) as aggregate from `pengaduan` where date(`created_at`) = '2026-06-07'
select count(*) as aggregate from `pengaduan` where year(`created_at`) = 2025 and month(`created_at`) = '07'

    public function getAdminStats(): array
    {
        return [
            'total_user'      => User::count(),
            'per_role'        => User::select('role', DB::raw('count(*) as total'))->groupBy('role')->pluck('total', 'role'),
            'pengaduan_hari'  => Pengaduan::whereDate('created_at', today())->count(),
            'pengaduan_bulan' => Pengaduan::whereMonth('created_at', now()->month)->count(),
---
select count(*) as aggregate from `users`
select `role`, count(*) as total from `users` group by `role`
select count(*) as aggregate from `pengaduan` where date(`created_at`) = '2026-06-07'
select count(*) as aggregate from `pengaduan` where month(`created_at`) = '06'