app/Services/PengaduanFilterService.php

select * from `users` where `users`.`id` in (3, 5)
select * from `petugas` order by `id` asc
---
    public function dropdownData(): array
    {
        return [
            'zonas'     => Zona::where('is_active', true)->orderBy('nama_zona')->get(),
            'kategoris' => Kategori::where('is_active', true)->orderBy('nama_kategori')->get(),
            'statuses'  => $this->statusOptions(),
            'petugas'   => Petugas::with('user')->orderBy('id')->get()
                ->sortBy(fn ($p) => $p->user?->name ?? '')
                ->values(),
        ];