app/Http/Controllers/Masyarakat/DashboardController.php

    public function index()
    {
        $pengaduanTerakhir = Pengaduan::with(['kategori', 'zona', 'sla'])
            ->where('user_id', auth()->id())
            ->latest()
            ->take(5)
            ->get();

        $totalPengaduan = Pengaduan::where('user_id', auth()->id())->count();
        $totalSelesai   = Pengaduan::where('user_id', auth()->id())->where('status', 'selesai')->count();
        $unreadNotif    = Notifikasi::where('user_id', auth()->id())->where('is_read', false)->count();
---
select * from "pengaduan" where "user_id" = 4 order by "created_at" desc limit 5
select count(*) as aggregate from "pengaduan" where "user_id" = 4
select count(*) as aggregate from "pengaduan" where "user_id" = 4 and "status" = 'selesai'
select count(*) as aggregate from "notifikasi" where "user_id" = 4 and "is_read" = 0