app/Http/Controllers/Masyarakat/PengaduanController.php

    public function create()
    {
        // FIX ERR-3: pakai KategoriPengaduan (model PBI-02) bukan Kategori lama
        $kategoris = KategoriPengaduan::where('is_active', true)->get();
---
select * from "kategori_pengaduan" where "is_active" = 1