app/Http/Controllers/Masyarakat/RiwayatController.php

    public function index(Request $request)
    {
        $pengaduan = Pengaduan::where('user_id', auth()->id())
            ->when($request->status, fn ($q, $v) => $q->where('status', $v))
            ->when($request->kategori_id, fn ($q, $v) => $q->where('kategori_id', $v))
            ->when($request->tanggal_dari, fn ($q, $v) => $q->whereDate('created_at', '>=', $v))
            ->when($request->tanggal_sampai, fn ($q, $v) => $q->whereDate('created_at', '<=', $v))
            ->with(['kategori', 'zona', 'assignment.petugas.user', 'rating'])
            ->orderByDesc('created_at')
            ->paginate(10)
            ->withQueryString();
---
select count(*) as aggregate from "pengaduan" where "user_id" = 4