app/Http/Requests/Auth/LoginRequest.php

    public function authenticate(): void
    {
        $this->ensureIsNotRateLimited();

        // Cek user aktif sebelum login
        $user = \App\Models\User::where('email', $this->email)->first();
---
select * from "users" where "email" = 'masyarakat@sigapair.test' limit 1