app/Http/Controllers/Admin/DaftarPengaduanController.php

select count(*) as aggregate from `pengaduan`
---
    public function index(Request $request)
    {
        $pengaduans = $this->pengaduanFilterService
            ->filteredQuery($request)
            ->paginate(15)
            ->withQueryString();