app/Http/Controllers/Admin/DashboardController.php

    public function index()
    {
        $stats = $this->dashboardService->getAllStats();
        $kpi         = $stats['kpi'];
        $perKategori = $stats['per_kategori'];
        $perZona     = $stats['per_zona'];
        $trenBulanan = $stats['tren_bulanan'];
        $adminStats  = $this->dashboardService->getAdminStats();
        $pengaduanTerbaru = Pengaduan::with(['pelapor', 'kategori', 'zona'])
            ->latest()
            ->take(8)
            ->get();
---
select * from `pengaduan` order by `created_at` desc limit 8