app/Http/Controllers/Admin/KategoriController.php

select count(*) as aggregate from `kategori_pengaduan`
---
    public function index()
    {
        $kategoris = KategoriPengaduan::withCount(['pengaduan', 'pengaduanAktif'])
            ->orderBy('nama_kategori')
            ->paginate(15);