app/Http/Controllers/Admin/PelangganController.php

    public function index(Request $request)
    {
        $filters = $request->only(['zona_id', 'is_active', 'search']);
        $pelanggan = Pelanggan::filter($filters)
            ->with(['zona', 'user', 'latestPengaduan.kategori'])
            ->paginate(15);
---
select count(*) as aggregate from `pelanggan`