app/Http/Controllers/Admin/PetugasController.php

    public function index(Request $request)
    {
        $query = Petugas::with(['user', 'zona'])
            ->latest();

        // Filter pencarian berdasarkan nama atau NIP
        if ($request->filled('search')) {
            $search = $request->search;
            $query->whereHas('user', function ($q) use ($search) {
                $q->where('name', 'like', "%{$search}%")
                  ->orWhere('email', 'like', "%{$search}%");
            })->orWhere('nip', 'like', "%{$search}%");
        }

        // Filter berdasarkan status
        if ($request->filled('status')) {
            $query->where('status_tersedia', $request->status);
---
select * from `users` where `users`.`id` in (78, 79, 80, 81)