app/Http/Controllers/Admin/UserController.php

    public function index(Request $request)
    {
        $users = User::when($request->search, function ($q, $v) {
                $q->where('name', 'like', "%{$v}%")
                  ->orWhere('email', 'like', "%{$v}%")
                  ->orWhere('username', 'like', "%{$v}%");
            })
            ->when($request->role, fn ($q, $v) => $q->where('role', $v))
            ->when($request->filled('is_active'), fn ($q) => $q->where('is_active', $request->boolean('is_active')))
            ->with('petugas.zona')
            ->orderByDesc('created_at')
            ->paginate(15)
            ->withQueryString();
---
select * from `petugas` where `petugas`.`user_id` in (1, 2, 3, 4, 5)
select * from `users` order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `users`